app/views/prototypes/_prototype.html.haml

  .thumbnail
    = link_to image_tag(prototype.captured_images.main.first.content), prototype_path(prototype)
    .caption
---
SELECT  `captured_images`.* FROM `captured_images` WHERE `captured_images`.`prototype_id` = 17  ORDER BY `captured_images`.`id` ASC LIMIT 1