app/views/likes/_like_button.html.haml

    - if prototype.like_user(current_user.id)
      = link_to prototype_like_path(id: prototype.likes.ids, prototype_id: prototype.id), method: :delete, remote: true do
        .fa.fa-heart.fa-2x.heart-red{id: "heart-#{prototype.id}"}
          = prototype.likes.count.to_s
---
SELECT `likes`.`id` FROM `likes` WHERE `likes`.`prototype_id` = 1
SELECT COUNT(*) FROM `likes` WHERE `likes`.`prototype_id` = 1