app/controllers/likes_controller.rb

INSERT INTO `likes` (`prototype_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2018-08-11 08:20:50', '2018-08-11 08:20:50')
---
  def create
    @like = current_user.likes.create(prototype_id: params[:prototype_id])

SELECT  `likes`.* FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`prototype_id` = 1 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 165
---
  def destroy
    like = current_user.likes.find_by(prototype_id: params[:prototype_id])
    like.destroy

SELECT  `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
SELECT `likes`.`id` FROM `likes` WHERE `likes`.`prototype_id` = 1
---
  def set_valiables
    @prototype = Prototype.find(params[:prototype_id])
    @likes = Like.includes(:prototype).where(prototype_id: params[:prototype_id])