app/controllers/prototypes_controller.rb

  def index
    @prototypes = Prototype.includes(:user).order(created_at: :desc).page(params[:page]).per(10)
---
SELECT  `prototypes`.* FROM `prototypes`  ORDER BY `prototypes`.`created_at` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `prototypes`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1)

  def create
    @prototype = Prototype.new(prototype_params)
    tag_list = params[:prototype][:tag_list].reject{|tag| tag == ""}
    if @prototype.save
      @prototype.save_prototypes(tag_list)
---
INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('samaple1', 'test1', 'test1', 1, '2018-08-04 08:02:42', '2018-08-04 08:02:42')
INSERT INTO `tags` (`name`, `created_at`, `updated_at`) VALUES ('攻殻機動隊', '2018-08-25 05:25:05', '2018-08-25 05:25:05')

  def destroy
    @prototype.destroy if current_user.id == @prototype.user.id
---
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 1

  def edit
    @tags = @prototype.tags
    tag_list = @prototype.tags.pluck(:name)
    @length = 3 - tag_list.length
    @captures = @prototype.captured_images
    @sub_image =[]
    @captures.each do |capture|
---
SELECT `tags`.`name` FROM `tags` INNER JOIN `tag_maps` ON `tags`.`id` = `tag_maps`.`tag_id` WHERE `tag_maps`.`prototype_id` = 10
SELECT `tags`.* FROM `tags` INNER JOIN `tag_maps` ON `tags`.`id` = `tag_maps`.`tag_id` WHERE `tag_maps`.`prototype_id` = 10
SELECT `captured_images`.* FROM `captured_images` WHERE `captured_images`.`prototype_id` = 1

  def update
    tag_list = params[:prototype][:tag_list]
    if @prototype.user_id == current_user.id
      @prototype.update(prototype_params)
      @prototype.save_prototypes(tag_list)
---
UPDATE `prototypes` SET `title` = '電車', `catch_copy` = '電車', `concept` = '電車', `updated_at` = '2018-09-01 07:55:28' WHERE `prototypes`.`id` = 15
INSERT INTO `tags` (`name`, `created_at`, `updated_at`) VALUES ('', '2018-09-01 03:50:06', '2018-09-01 03:50:06')

  def popular
    @prototypes = Prototype.includes(:user).popular
---
SELECT `prototypes`.* FROM `prototypes`  ORDER BY like_count DESC
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2)

  def newest
    @prototypes = Prototype.includes(:user).newest
---
SELECT `prototypes`.* FROM `prototypes`  ORDER BY created_at DESC
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 1)

  def set_prototype
    @prototype = Prototype.find(params[:id])
---
SELECT  `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1