app/controllers/tags_controller.rb

SELECT  `tags`.* FROM `tags` LIMIT 20 OFFSET 0
---
  def index
    @tags = Tag.all.page(params[:page]).per(20)

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 3 LIMIT 1
SELECT  `prototypes`.* FROM `prototypes` INNER JOIN `tag_maps` ON `prototypes`.`id` = `tag_maps`.`prototype_id` WHERE `tag_maps`.`tag_id` = 3 LIMIT 10 OFFSET 0
---
  def show
    @tag = Tag.find(params[:id])
    @prototypes = @tag.prototypes.page(params[:page]).per(10)

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 6 LIMIT 1
DELETE FROM `tags` WHERE `tags`.`id` = 6
---
  def destroy
    @tag = Tag.find(params[:id])
    @tag.destroy